In [1]:
import pandas as pd

Indexing lets you access different parts of your dataframes

1. column series

In [3]:
data = {
    'name': ['gokul', 'vatsa', 'chatrapathi'],
    'age': [17, 16, 17],
    'place': ['kadapa', 'kurnool', 'kurnool'],
    'marks': [90, 80, 70],
    'grade': ['A', 'B', 'C']
}
df = pd.DataFrame(data)
df

          name  age    place  marks grade
0        gokul   17   kadapa     90     A
1        vatsa   16  kurnool     80     B
2  chatrapathi   17  kurnool     70     C

In [5]:
df['marks'] #return series
df[['marks', 'grade']]

   marks grade
0     90     A
1     80     B
2     70     C

2. Row selection

In [ ]:
#using loc
df.loc[0]
df.loc[0:2]

          name  age    place  marks grade
0        gokul   17   kadapa     90     A
1        vatsa   16  kurnool     80     B
2  chatrapathi   17  kurnool     70     C

In [9]:
#using iloc
df.iloc[0]
df.iloc[0:2] #(exclusive)

    name  age    place  marks grade
0  gokul   17   kadapa     90     A
1  vatsa   16  kurnool     80     B

3. Row and Column together

In [11]:
df.loc[0, 'marks']
df.iloc[0, 1]

np.int64(17)

4. conditional filtering

In [12]:
df[df['marks'] >= 80]

    name  age    place  marks grade
0  gokul   17   kadapa     90     A
1  vatsa   16  kurnool     80     B

In [13]:
#multiple
df[(df['marks']> 80) & (df['grade']=='A')]

    name  age   place  marks grade
0  gokul   17  kadapa     90     A